doc/release-notes/python3-on-rhel7.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2020-04-01 Wed 21:13 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Python3 usage by pbench on RHEL7</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Nick Dokos" />
<meta name="keywords" content="pbench" />
<link rel="stylesheet" href="../../stylesheets/normalize.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/stylesheet.css" type="text/css"/>
<link rel="stylesheet" href="../../stylesheets/github-light.css" type="text/css"/>
</head>
<body>
<div id="content">
<h1 class="title">Python3 usage by pbench on RHEL7</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org13fb75f">SCL</a></li>
</ul>
</div>
</div>

<div id="outline-container-org13fb75f" class="outline-2">
<h2 id="org13fb75f">SCL</h2>
<div class="outline-text-2" id="text-org13fb75f">
<p>
We are using <code>python3</code> exclusively for <code>pbench-agent</code> and <code>pbench-server</code> as of v0.67.
RHEL7 includes support for <code>python3</code> through the Software Collections Library. So RHEL7
<code>pbench-agent</code> installations require two extra packages: <code>scl-utils</code> and <code>rh-python36</code>.
</p>

<p>
For "normal" usage of <code>pbench-agent</code>, this is invisible: we take care
to use the SCL environment internally, without allowing that to "leak"
to the end user. There is one historical area however where it might
help to know a bit more about what's being done underneath the
surface: <code>configtools</code>, <code>getconf.py</code> and the <code>CONFIG</code> environment variable.
</p>

<p>
We no longer use a separate <code>configtools</code> package: the functionality has been folded
into pbench proper. On the agent side, the <code>CONFIG</code> environment variable has been
replaced by the <code>_PBENCH_AGENT_CONFIG</code> environment variable and <code>getconf.py</code> is no
longer in <code>/usr/bin</code> or <code>/usr/local/bin</code>: it is now in <code>/opt/pbench-agent/util-scripts</code>.
</p>

<p>
Historically, we used to test for proper installation of <code>configtools</code> and the pbench-agent
config files by using:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">is the environment variable set? This should say /opt/pbench-agent/config/pbench-agent.cfg</span>
<span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">does it point to a config file? This should look like a config file...</span>
cat $<span style="font-weight: bold; font-style: italic;">CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">where does getconf.py live? This should say /usr/bin/getconf.py</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">(or in some cases /usr/local/bin/getconf.py)</span>
<span style="font-weight: bold;">command</span> -v getconf.py
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">what is the list of config files in use? This should say ['/opt/pbench-agent/config/pbench-agent.cfg', '/opt/pbench-agent/config/pbench-agent-default.cfg']</span>
getconf.py -L
</pre>
</div>
<p>
plus possibly more calls of <code>getconf.py</code> to verify details of the config files.
</p>

<p>
For Fedora and RHEL8 systems that support <code>python3</code> natively, the main change is
the environment variable name change and the location change. Assuming that you
have sourced the <code>/etc/profile.d/pbench-agent.sh</code> file, the new environment variable
should be set properly and <code>/opt/pbench-agent/util-scripts</code> should be added to the PATH,
so the analogous invocation goes like this:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">is the environment variable set?</span>
<span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">_PBENCH_AGENT_CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">does it point to a config file?</span>
cat $<span style="font-weight: bold; font-style: italic;">_PBENCH_AGENT_CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">where does getconf.py live? This should say /opt/pbench-agent/util-scripts/getconf.py</span>
<span style="font-weight: bold;">command</span> -v getconf.py
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">what is the list of config files in use?</span>
getconf.py -L
</pre>
</div>

<p>
For RHEL7 however, you need an extra step: you need to enable the python3 SCL environment
before issuing any of the above commands:
</p>
<div class="org-src-container">
<pre class="src src-shell"><span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">enter the python3 SCL environment</span>
scl enable rh-python36 bash
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">*now* you can check the rest as before ...</span>

<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">is the environment variable set?</span>
<span style="font-weight: bold;">echo</span> $<span style="font-weight: bold; font-style: italic;">_PBENCH_AGENT_CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">does it point to a config file?</span>
cat $<span style="font-weight: bold; font-style: italic;">_PBENCH_AGENT_CONFIG</span>
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">where does getconf.py live? This should say /opt/pbench-agent/util-scripts/getconf.py</span>
<span style="font-weight: bold;">command</span> -v getconf.py
<span style="font-weight: bold; font-style: italic;"># </span><span style="font-weight: bold; font-style: italic;">what is the list of config files in use?</span>
getconf.py -L
</pre>
</div>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Page updated: 2020-04-01 Wed 21:13</p>
</div>
</body>
</html>
